MAPS = [
    "モノル_F2",
    "モノル_F1",
    "モノル_BF1",
    "初期の島",
    "南の島",
    "塔_1_F1",
    "塔_1_F2",
    "塔_1_F3",
    "テスト",
    "テスト2",
    "洞窟_BF1_南側",
    "洞窟_BF2_南側",
    "洞窟_BF3_南側",
    "洞窟_BF1_北側",
    "洞窟_BF2_北側",
    "洞窟_BF3_北側",
    "北の島",
    "港の島",
    "神殿_01_F1",
    "神殿_01_F2",
    "神殿_01_F3",
    "ジルジノ",
    "海",
]

DEBUG_MAPS = [
    {
        "name": "モノル_F2",
        "to": (260, 416),
    },
    {
        "name": "モノル_F1",
        "to": (480, 864),
    },
    {
        "name": "モノル_BF1",
        "to": (32, 64),
    },
    {
        "name": "初期の島",
        "to": (800, 512),
    },
    {
        "name": "北の島",
        "to": (800, 960),
    },
    {
        "name": "港の島",
        "to": (192, 192),
    },
    {
        "name": "テスト",
        "to": (32, 32),
    },
    {
        "name": "テスト2",
        "to": (120, 120),
    },
]