SW = 1280
SH = 720

ML = 1
MM = 2
MR = 3
MUP = 4
MDOWN = 4

FPS=60

# ////////////////////////////////////////////////
#
# マップ系
#
# ////////////////////////////////////////////////
MAP_IS_LOAD = True
MAP_NAME = "テスト2"
MAP_WIDTH = 64
MAP_HEIGHT = 64
MAP_MSIZE = 32
# -1だと0埋めされる
MAP_BG_ID = 1
MAP_CONF = {
    100: ["モノル_BF1", 32, 64],
    101: ["モノル_F1", 480, 864],
    102: ["モノル_F2", 260, 416],
    103: ["初期の島", 800, 512],
    "monster_info": {
        "kinds": ["goburin", "suraimu"],
        "min": 4,
        "max": 8,
    }
}